Thanks @rawmind0, I just tried both of those with the above `.tf` file and they both give the error
```
Error: Bad response statusCode [500]. Status [500 Internal Server Error]. Body: [baseType=error, code=ServerError, message=catalogtemplateversions.management.cattle.io "jetstack-test-cert-manager-0.15.0" not found] from [https://rancher.xmple.io/v3/project/c-wghjf:p-c2hdq/apps]
```
This is the plan that it tries to execute...
```
data.terraform_remote_state.rancher: Refreshing state...
data.rancher2_cluster.test: Refreshing state...
rancher2_catalog.jetstack_global: Refreshing state... [id=jetstack-test]
data.rancher2_project.system: Refreshing state...
rancher2_catalog.jetstack_cluster: Refreshing state... [id=c-wghjf:jetstack-test]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # rancher2_app.cert_manager will be created
  + resource "rancher2_app" "cert_manager" {
      + annotations      = (known after apply)
      + answers          = {
          + "cainjector.image.pullPolicy" = "Always"
          + "extraArgs"                   = "--dns01-recursive-nameservers=1.1.1.1:53,1.0.0.1:53"
          + "image.pullPolicy"            = "Always"
          + "webhook.image.pullPolicy"    = "Always"
        }
      + catalog_name     = "c-wghjf:jetstack-test"
      + description      = (known after apply)
      + external_id      = (known after apply)
      + force_upgrade    = false
      + id               = (known after apply)
      + labels           = (known after apply)
      + name             = "cert-manager"
      + project_id       = "c-wghjf:p-c2hdq"
      + revision_id      = (known after apply)
      + target_namespace = "cert-manager"
      + template_name    = "cert-manager"
      + template_version = (known after apply)
    }
```